{
  "backend/main.mo": "Actor managing players, cash, profiles, rewards, and rate‑limited coin pickups with admin-only cash controls and authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping game rendering and asset‑upgrade features to affected files and components with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend files including pages, components, hooks, and game systems.",
  "frontend/index.css": "Empty CSS file placeholder with no content.",
  "frontend/index.html": "HTML entry page that loads the React app via main.tsx into a root div.",
  "frontend/src/App.tsx": "Root component that checks Internet Identity auth and conditionally renders the SignInPage or GamePage.",
  "frontend/src/components/AdminLeaderboardControls.tsx": "Admin-only UI card allowing admins to enforce leaderboard leadership with feedback states and mutation handling.",
  "frontend/src/components/GameLayout.tsx": "Shared layout component providing header, footer, and main content structure for the game UI.",
  "frontend/src/components/LeaderboardPanel.tsx": "Displays the cash leaderboard with rank styling, admin markers, user highlighting, and loading states.",
  "frontend/src/components/LoginButton.tsx": "Authentication button handling login/logout via Internet Identity with visual states and query cache clearing.",
  "frontend/src/game/runner/runnerAssets.ts": "Loads and manages image assets for coins, obstacles, track tiles, and player sprites.",
  "frontend/src/game/runner/RunnerCanvas3D.tsx": "Canvas component that renders the 3D runner scene, handling scaling, asset loading, and drawing entities with perspective.",
  "frontend/src/game/runner/RunnerHUD.tsx": "Displays cash, distance, coin count, and error messages as an in-game HUD.",
  "frontend/src/game/runner/RunnerOverlays.tsx": "Renders start, pause, game over, and in‑run overlays with controls for gameplay state transitions.",
  "frontend/src/game/runner/runnerRenderUtils.ts": "Contains detailed procedural rendering helpers for coins, obstacles, and other objects.",
  "frontend/src/game/runner/runnerTheme.ts": "Converts CSS theme variables to canvas‑friendly colors and offers brightness adjustment utilities.",
  "frontend/src/game/runner/TouchControls.tsx": "Provides on-screen mobile controls for movement, jumping, and sliding.",
  "frontend/src/game/runner/types.ts": "Defines runner game domain types, lane constants, player state, entities, run states, and config values.",
  "frontend/src/game/runner/useCoinCashAwarder.ts": "Batches coin awards and triggers addCash mutations with a delayed flush to avoid backend spam.",
  "frontend/src/game/runner/useRunnerControls.ts": "Handles keyboard controls for lane changes, jumping, sliding, and pausing, exposing equivalents for touch input.",
  "frontend/src/game/runner/useRunnerGame.ts": "Implements the main runner game loop with spawning, movement, collision, coin collection, and state updates.",
  "frontend/src/hooks/useActor.ts": "Loads an authenticated or anonymous backend actor and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCashActions.ts": "Provides mutations for initializing cash, adding cash, claiming rewards, and upgrading speed, with query invalidation.",
  "frontend/src/hooks/useCashLeaderboard.ts": "Fetches the cash leaderboard with polling, using the current actor.",
  "frontend/src/hooks/useEnforceAdminLeadership.ts": "Runs a mutation to set the admin as leaderboard leader and refreshes related queries with error handling.",
  "frontend/src/hooks/useEnsurePlayerInitialized.ts": "Coordinates player initialization by checking status, running initializeCash when needed, and exposing readiness state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity, login, logout, and login status.",
  "frontend/src/hooks/usePlayerStatus.ts": "Fetches the player's status periodically using the current actor.",
  "frontend/src/hooks/useUserRole.ts": "Queries whether the current caller is an admin.",
  "frontend/src/index.css": "Defines global Tailwind CSS variables, themes, and base styles including canvas and text-selection rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/GamePage.tsx": "Implements the main gameplay page, initializing the player, managing runner game state, controls, and rendering 3D canvas and HUD components with loading and error states.",
  "frontend/src/pages/SignInPage.tsx": "Renders a sign‑in screen with branding, feature highlights, and a login button inside the game layout.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, and clear URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins including typography and container queries.",
  "project_state.json": "Tracks project metadata, feature requirements, image needs, and state versioning for the visual detail upgrade project."
}