{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "High-detail runner canvas visuals with sprites + procedural fallbacks",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render coins as high-detail, multi-layered visuals with lightweight shimmer/rotation while preserving gameplay performance and collision behavior.",
      "acceptanceCriteria": [
        "Coins in RunnerCanvas3D no longer appear as a single flat filled circle with a simple stroke; they have multiple visual layers (highlight + rim/edge + inner detail + shadow) that read as a ‘coin’.",
        "Coin detail scales correctly with distance (perspective scale) and remains visually clear across typical canvas sizes.",
        "The coin animation effect (e.g., shimmer/rotation) does not break collision/collection logic and does not noticeably reduce frame rate compared to current behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/runner/RunnerCanvas3D.tsx",
          "operation": "modify",
          "description": "Upgrade coin rendering to a layered, coin-like appearance (rim/thickness illusion, inner emboss, specular highlight, subtle shadow) and add a lightweight time-based shimmer/rotation effect that only affects drawing (not entity positions/collision). Refactor the render loop to use stable refs for game state and a single requestAnimationFrame loop to avoid re-subscribing on every state change and keep frame rate stable."
        },
        {
          "path": "frontend/src/game/runner/runnerRenderUtils.ts",
          "operation": "create",
          "description": "Add reusable canvas helper functions for high-detail procedural rendering (e.g., layered coin drawing with gradients/highlight/shadow, consistent shading utilities) designed to scale cleanly with perspective scale and minimize per-frame allocations."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Increase visual detail for track/ground, lane dividers, obstacles, and player with consistent shading/lighting cues derived from existing theme CSS variables.",
      "acceptanceCriteria": [
        "Track/ground rendering includes additional depth/detail beyond a single filled shape (e.g., gradient, texture-like pattern, edge shading, or subtle motion cues) while preserving the current perspective layout.",
        "Obstacles visually read as distinct objects (low vs high) with added shading/edges and improved silhouettes compared to single-color rectangles.",
        "Player rendering is more detailed than a single rectangle and clearly communicates jump/slide states visually (without changing gameplay rules).",
        "All updated visuals still respect the current light/dark theme CSS variables (background/primary/accent/muted) and remain legible in both themes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/runner/RunnerCanvas3D.tsx",
          "operation": "modify",
          "description": "Enhance non-coin rendering: add track depth cues (gradient/edge shading + optional texture overlay), improve lane divider styling (perspective-aware thickness/dash + subtle glow), render obstacles with richer silhouettes and shading (distinct low vs high), and replace the player rectangle with a more detailed procedural/sprite-based runner that visually reflects jump/slide states while keeping the same gameplay rules and perspective layout."
        },
        {
          "path": "frontend/src/game/runner/runnerTheme.ts",
          "operation": "create",
          "description": "Centralize reading and normalization of theme colors from CSS variables (background/primary/accent/muted) into canvas-ready color values so RunnerCanvas3D can apply consistent lighting/shading cues in both light and dark themes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add generated sprite/texture assets for runner objects, load them from public assets at runtime, and fall back to detailed procedural drawing if loading fails.",
      "acceptanceCriteria": [
        "New image assets are placed under frontend/public/assets/generated and are referenced directly by the frontend (no backend routing).",
        "RunnerCanvas3D can render using the new assets when available (e.g., drawImage) and falls back to the procedural detailed drawing without runtime errors if assets are missing/unloaded.",
        "No user-facing text is added that is not in English."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/runner-coin-sprite.dim_256x256.png",
          "operation": "create",
          "description": "Add generated asset: Detailed gold coin sprite with rim, emboss, and specular highlights on transparent background."
        },
        {
          "path": "frontend/public/assets/generated/runner-obstacle-low.dim_256x256.png",
          "operation": "create",
          "description": "Add generated asset: Detailed low obstacle texture/sprite with shaded edges and surface detail on transparent background."
        },
        {
          "path": "frontend/public/assets/generated/runner-obstacle-high.dim_256x256.png",
          "operation": "create",
          "description": "Add generated asset: Detailed high obstacle texture/sprite with shaded edges and surface detail on transparent background."
        },
        {
          "path": "frontend/public/assets/generated/runner-track-tile.dim_512x512.png",
          "operation": "create",
          "description": "Add generated asset: Subtle track/ground texture or pattern tile that works in both light/dark palettes."
        },
        {
          "path": "frontend/public/assets/generated/runner-player-sprite.dim_256x256.png",
          "operation": "create",
          "description": "Add generated asset: Simple stylized runner/player sprite with clear silhouette and shading on transparent background."
        },
        {
          "path": "frontend/src/game/runner/runnerAssets.ts",
          "operation": "create",
          "description": "Implement a small image preloader/cache for runner sprites/textures loaded from frontend/public/assets/generated (coin, obstacles, track tile, player). Expose loaded/failed status so RunnerCanvas3D can draw sprites when ready and otherwise use the procedural detailed fallback without throwing."
        },
        {
          "path": "frontend/src/game/runner/RunnerCanvas3D.tsx",
          "operation": "modify",
          "description": "Wire the new generated assets into rendering: attempt to draw runner sprites/textures (drawImage/pattern) when loaded; if any asset is missing or fails to load, render the equivalent high-detail procedural version without runtime errors. Ensure sprite usage respects perspective scale and does not affect collision/collection logic."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update the HUD coin icon asset to match the new in-world coin style while preserving the HUD layout and sizing.",
      "acceptanceCriteria": [
        "The HUD coin icon at /assets/generated/coin-icon.dim_256x256.png is replaced by a more detailed version consistent with the in-world coin look.",
        "RunnerHUD continues to render the coin icon without layout regressions (size remains 32x32 in the HUD)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/coin-icon.dim_256x256.png",
          "operation": "modify",
          "description": "Replace the existing HUD coin icon binary with a more detailed coin icon consistent with the updated in-world coin style (transparent background)."
        },
        {
          "path": "frontend/public/assets/generated/coin-icon-detailed.dim_256x256.png",
          "operation": "create",
          "description": "Add the edited/polished version of the coin HUD icon as a separate generated asset (for traceability), matching the new coin style with a clean transparent background."
        },
        {
          "path": "frontend/src/game/runner/RunnerHUD.tsx",
          "operation": "modify",
          "description": "Confirm HUD continues to reference /assets/generated/coin-icon.dim_256x256.png and that the icon remains 32x32 with no layout regressions after the asset update."
        }
      ]
    }
  ]
}